hapaxx11/M1/m1_csrc/m1_esp32_caps.c
#define S_AT_CMD_CAP_MAP_N \
    (sizeof(s_at_cmd_cap_map) / sizeof(s_at_cmd_cap_map[0]))

/*************** I N T E R N A L   H E L P E R S *****************************/

/**
 * Set memory footprint estimates based on the resolved capability bitmap.
 * Four-way discriminator (evaluated in priority order):
 *   HANDSHAKE + OTA present → CD3 native (bedge117/m1-esp32-brain) — in
 *                             practice no shipped release currently sets
 *                             either bit; see m1_esp32_caps.h CAP_OTA/
 *                             CAP_HANDSHAKE comments
 *   WIFI_JOIN + BEACON      → dag T-800 (AT firmware with custom cmds)
 *   WIFI_JOIN alone         → CD3-AT (bedge117/neddy299)
 *   neither WIFI_JOIN       → SiN360 binary-SPI
 */
static void caps_apply_footprint_estimates(uint64_t bitmap)
{
    if ((bitmap & M1_ESP32_CAP_HANDSHAKE) &&
        (bitmap & M1_ESP32_CAP_OTA))
    {
        /* CD3 native binary RPC firmware (bedge117/m1-esp32-brain) */
        s_bss_bytes       = M1_ESP32_FALLBACK_BSS_CD3;
        s_free_heap_bytes = M1_ESP32_FALLBACK_HEAP_CD3;
    }
    else if ((bitmap & M1_ESP32_CAP_WIFI_JOIN) &&
             (bitmap & M1_ESP32_CAP_BEACON))
    {
        /* dag T-800: AT firmware with custom WiFi/HID/Zigbee commands */
        s_bss_bytes       = M1_ESP32_FALLBACK_BSS_T800;
        s_free_heap_bytes = M1_ESP32_FALLBACK_HEAP_T800;
    }
    else if (bitmap & M1_ESP32_CAP_WIFI_JOIN)
    {
        /* CD3-AT (bedge117 base) / neddy299 */
        s_bss_bytes       = M1_ESP32_FALLBACK_BSS_AT;
        s_free_heap_bytes = M1_ESP32_FALLBACK_HEAP_AT;
    }
    else
    {
        /* SiN360 binary SPI firmware */
        s_bss_bytes       = M1_ESP32_FALLBACK_BSS_SIN360;
        s_free_heap_bytes = M1_ESP32_FALLBACK_HEAP_SIN360;
    }
}

/*************** P U B L I C   A P I ******************************************/

void m1_esp32_caps_init(void)
{
    m1_resp_t resp;
    int       ret;
    uint64_t  bitmap        = 0u;
    char      fw_name[32]   = {0};

    if (s_queried)
        return;  /* Already cached from a previous call */

    /* Require the SPI HAL transport to be active before sending any binary
     * commands.  If the ESP32 has not been initialised yet (or was
     * deinitialized), return without caching so the next call retries once
     * the transport is ready.  Probing an uninitialised transport would time
     * out and cache the fallback, potentially mis-attributing capabilities. */
    if (!m1_esp32_get_init_status())
        return;

    /* Probe 0: binary CMD_PING (0x01) — SiN360 binary-SPI firmware detection.
     * CMD_GET_STATUS (0x02) was proposed as a capability-reporting command
     * but never fully implemented in SiN360 firmware.  The actual SiN360
     * cmd_get_status() implementation (sincere360/M1_SiN360_ESP32) returns
     * only a 5-byte version payload, not the 41-byte capability report that
     * m1_esp32_caps_parse_payload() expects.  Because SiN360 has no AT task,
     * the AT+CMD? probe also fails, leaving SiN360 misdetected as "Unknown".
     *
     * CMD_PING is universally implemented by all binary-SPI firmware and
     * returns a simple "PONG" (4 bytes) payload.  If CMD_PING succeeds, we
     * know the ESP32 speaks the binary SPI protocol.  We record that fact
     * but do NOT return here — Probe 1 (CMD_GET_STATUS) still runs so that
     * a future firmware implementing the full capability-reporting protocol
     * is detected via Probe 1 rather than defaulting to the SiN360 profile. */
    ret = m1_esp32_simple_cmd(CMD_PING, &resp, CAPS_QUERY_TIMEOUT_MS);

    bool is_binary_spi = (ret == 0 && resp.status == RESP_OK &&
                          resp.payload_len == 4 &&
                          resp.payload[0] == 'P' && resp.payload[1] == 'O' &&
                          resp.payload[2] == 'N' && resp.payload[3] == 'G');

    /* Probe 1: binary CMD_GET_STATUS (0x02).  AT firmware that implements
     * the binary extension (e.g. hapaxx11/esp32-at-monstatek-m1) would
     * respond here with a full capability report.  Unextended AT firmware
     * (bedge117, dag) will return RESP_ERR or time out.  Current SiN360
     * firmware (v0.9.1.0) returns only a 5-byte version payload, which
     * fails the parse check below. */
    ret = m1_esp32_simple_cmd(CMD_GET_STATUS, &resp, CAPS_QUERY_TIMEOUT_MS);

    if (ret == 0 && resp.status == RESP_OK &&
        m1_esp32_caps_parse_payload(resp.payload, resp.payload_len,
                                    &bitmap, fw_name))
    {
        s_bitmap = bitmap;
        strncpy(s_fw_name, fw_name, sizeof(s_fw_name) - 1);
        s_fw_name[sizeof(s_fw_name) - 1] = '\0';
        caps_apply_footprint_estimates(s_bitmap);
        s_queried = true;
        return;
    }

    if (is_binary_spi)
    {
        /* PING succeeded (binary-SPI firmware confirmed) but CMD_GET_STATUS
         * did not provide a full capability report.  This is the current
         * SiN360 case — use the SiN360 fallback profile. */
        s_bitmap = M1_ESP32_CAP_PROFILE_SIN360;
        strncpy(s_fw_name, "SiN360 (via PING)", sizeof(s_fw_name) - 1);
        s_fw_name[sizeof(s_fw_name) - 1] = '\0';
        caps_apply_footprint_estimates(s_bitmap);
        s_queried = true;
        return;
    }

    /* From here on the firmware is not SiN360 binary-SPI.  It is either an
     * AT firmware (stock ESP-AT, bedge117/dag/neddy299 variants) or the CD3
     * native binary-RPC firmware (bedge117/m1-esp32-brain).  BOTH speak over
     * the same half-duplex SPI-HD transport (spi_slave_hd: command/address/
     * dummy phases + WRBUF/RDDMA + HANDSHAKE) driven by the AT RTOS task, so
     * the task must be running before either the AT+CMD? text probe or the
     * M1_RPC binary probe below can exchange a frame.
     *
     * The AT task is not started by the DELEGATE_FEATURE-style capability
     * gates that call us (they only bring up the SPI HAL via
     * m1_esp32_ensure_init()); the AT task is otherwise only started deep
     * inside each feature function *after* the gate has been evaluated.  Left
     * unaddressed, this permanently fails detection ("Unknown" firmware, cap
     * bits never set) even for fully-supported firmware.  Start the AT task
     * here, mirroring wifi_do_scan() (m1_wifi.c).  If the task still is not up
     * right after trying (e.g. heap pressure), return without caching so the
     * next call retries.
     *
     * SiN360 binary-SPI firmware has no AT task and was already handled above
     * via the is_binary_spi early return, so it never reaches this point. */
    {
        bool at_task_before = get_esp32_main_init_status();
        bool at_task_after  = at_task_before;

