hapaxx11/M1/m1_csrc/m1_esp32_caps.c
        if (!at_task_before)
        {
            esp32_main_init();
            at_task_after = get_esp32_main_init_status();
        }

        if (!m1_esp32_caps_should_run_at_probe(at_task_before, at_task_after))
            return;
    }

    /* Probe 2a: quick AT presence check.  Send a bare "AT\r\n" with a short
     * timeout — any AT firmware answers "OK" almost immediately.  CD3 native
     * firmware (which speaks M1_RPC, not AT) will not reply, so this times
     * out in AT_PRESENCE_TIMEOUT_S (1 s) instead of paying the full
     * AT_CMD_PROBE_TIMEOUT_S (5 s) for the heavyweight AT+CMD? probe.
     *
     * If the presence probe fails, skip directly to the CD3 binary probe
     * (Probe 3) — there is no point waiting 5 s for AT+CMD? when the
     * firmware does not even answer a bare AT. */
    {
        char at_presence[64];
        at_presence[0] = '\0';
        (void)spi_AT_send_recv("AT\r\n", at_presence,
                               (int)sizeof(at_presence),
                               AT_PRESENCE_TIMEOUT_S);

        if (strstr(at_presence, "OK") == NULL)
            goto probe_cd3;  /* Not AT firmware — skip to CD3 probe */
    }

    /* Probe 2b: stock ESP-AT `AT+CMD?`.  This command is part of the basic
     * ESP-AT command set and is supported by all tracked AT firmware variants
     * (bedge117, dag, neddy299) without requiring any custom extension.  The
     * response lists every AT command the firmware understands; we OR in
     * capability bits for each command our mapping table recognises.
     *
     * We only reach here if the quick AT presence probe above succeeded, so
     * this is guaranteed to be an AT firmware and will respond promptly.
     *
     * The response can be several KB, so the buffer is allocated from the
     * FreeRTOS heap rather than the caller's stack.  If the heap is
     * exhausted, return without caching so the next call retries. */
    {
        char *at_resp = (char *)pvPortMalloc(AT_CMD_RESP_BUF_SZ);
        if (!at_resp)
            return;  /* Heap exhausted — retry on next call */

        at_resp[0] = '\0';
        (void)spi_AT_send_recv("AT+CMD?\r\n", at_resp,
                               (int)AT_CMD_RESP_BUF_SZ,
                               AT_CMD_PROBE_TIMEOUT_S);

        if (m1_esp32_caps_at_cmd_response_valid(at_resp))
        {
            /* Probe succeeded — OR in every tracked AT command the
             * firmware advertised.  A response that contains "+CMD:"
             * lines but none of our tracked names is still a successful
             * probe; the bitmap simply reflects that the firmware has
             * no features we currently recognise. */
            s_bitmap = m1_esp32_caps_parse_at_cmd_list(
                at_resp, s_at_cmd_cap_map, S_AT_CMD_CAP_MAP_N);
            strncpy(s_fw_name, "AT (probed)", sizeof(s_fw_name) - 1);
            s_fw_name[sizeof(s_fw_name) - 1] = '\0';
            caps_apply_footprint_estimates(s_bitmap);
            s_queried = true;
            vPortFree(at_resp);
            return;
        }

        vPortFree(at_resp);
    }

    /* Probe 3: CD3 native "brain" binary RPC firmware (hapaxx11/m1-esp32-brain)
     * via M1_RPC PING (magic 0x4D31 "M1").
     *
     * The brain CD3 is an ESP-IDF full-duplex `spi_slave` device: every
     * transaction clocks EXACTLY 512 bytes in both directions and the reply is
     * pipelined onto a later transaction.  This is fundamentally different from
     * the ESP-AT half-duplex `spi_slave_hd` command protocol — sending AT-style
     * HD frames (spi_AT_send_recv_bin) to a full-duplex slave yields no answer,
     * which is why CD3 detection and every brain feature failed.  The
     * request/response MUST therefore go through spi_m1link_send_recv_bin(),
     * the 512-byte full-duplex "M1 Link" transport (see esp_app_main.c), which
     * builds the padded frame, honours the HANDSHAKE line, and reassembles the
     * pipelined reply.
     *
     * This probe runs only after the AT presence probe has failed (or AT+CMD?
     * did not yield a valid response), so a working AT firmware (already
     * detected above) is never driven with the full-duplex transport.
     *
     * On success we immediately follow up with M1_RPC GET_STATUS to retrieve
     * the capability bitmap.  If GET_STATUS fails after PING succeeds (early-
     * stage firmware not yet implementing GET_STATUS), we fall back to the
     * CD3 conservative profile macro. */
probe_cd3:
    {
        uint8_t  tx64[64];
        uint8_t  rx64[64];
        static const uint8_t cd3_cookie[4] = {0x4D, 0x31, 0x50, 0x49}; /* "M1PI" */
        uint16_t req_len;
        int      rx_len = 0;
        const uint8_t *rpc_pl  = NULL;
        uint16_t       rpc_plen = 0u;

        memset(tx64, 0, sizeof(tx64));
        req_len = m1_esp32_rpc_build_req(tx64, (uint16_t)sizeof(tx64),
                                          M1_ESP32_RPC_SYS_PING,
                                          cd3_cookie, 4u);
        if (req_len > 0u)
        {
            memset(rx64, 0, sizeof(rx64));
            rx_len = 0;

            if (spi_m1link_send_recv_bin(tx64, (int)req_len,
                                     rx64, (int)sizeof(rx64),
                                     &rx_len, CD3_RPC_PROBE_TIMEOUT_S) == 0 &&
                rx_len > 0 &&
                m1_esp32_rpc_parse_resp(rx64, (uint16_t)rx_len,
                                         M1_ESP32_RPC_SYS_PING,
                                         &rpc_pl, &rpc_plen))
            {
                /* CD3 confirmed — issue GET_STATUS to retrieve capabilities */
                memset(tx64, 0, sizeof(tx64));
                req_len = m1_esp32_rpc_build_req(tx64, (uint16_t)sizeof(tx64),
                                                  M1_ESP32_RPC_SYS_GET_STATUS,
                                                  NULL, 0u);
                if (req_len > 0u)
                {
                    memset(rx64, 0, sizeof(rx64));
                    rx_len   = 0;
                    rpc_pl   = NULL;
                    rpc_plen = 0u;
                    if (spi_m1link_send_recv_bin(tx64, (int)req_len,
                                             rx64, (int)sizeof(rx64),
                                             &rx_len, CD3_RPC_PROBE_TIMEOUT_S) == 0 &&
                        rx_len > 0 &&
                        m1_esp32_rpc_parse_resp(rx64, (uint16_t)rx_len,
                                                 M1_ESP32_RPC_SYS_GET_STATUS,
                                                 &rpc_pl, &rpc_plen) &&
                        rpc_plen >= (uint16_t)sizeof(m1_esp32_rpc_devstatus_t) &&
                        m1_esp32_caps_parse_payload(rpc_pl,
                                                     (uint8_t)rpc_plen,
                                                     &bitmap, fw_name))
                    {
                        s_bitmap = bitmap;
                        strncpy(s_fw_name, fw_name, sizeof(s_fw_name) - 1);
                        s_fw_name[sizeof(s_fw_name) - 1] = '\0';
                        caps_apply_footprint_estimates(s_bitmap);
                        s_queried = true;
                        return;
                    }
                }

                /* PING confirmed CD3 but GET_STATUS is not yet implemented —
                 * use the conservative CD3 profile macro. */
                s_bitmap = M1_ESP32_CAP_PROFILE_CD3;
                strncpy(s_fw_name, "CD3 (via M1_RPC)", sizeof(s_fw_name) - 1);
                s_fw_name[sizeof(s_fw_name) - 1] = '\0';
                caps_apply_footprint_estimates(s_bitmap);
                s_queried = true;
                return;
            }
        }
    }

