hapaxx11/M1/m1_csrc/m1_esp32_caps.c
    /* All probes failed — fail closed.  Feature gates that check specific
     * M1_ESP32_CAP_* bits will all return false and the "Feature not
     * supported" UI will appear.  This is intentional: granting capabilities
     * we cannot verify risks crashing on firmware that does not implement
     * the underlying command. */
    s_bitmap = 0u;
    strncpy(s_fw_name, "Unknown (fallback)", sizeof(s_fw_name) - 1);
    s_fw_name[sizeof(s_fw_name) - 1] = '\0';
    caps_apply_footprint_estimates(0u);
    s_queried = true;
}

void m1_esp32_caps_reset(void)
{
    s_bitmap          = 0u;
    s_bss_bytes       = 0u;
    s_free_heap_bytes = 0u;
    s_queried         = false;
    s_fw_name[0]      = '\0';
}

bool m1_esp32_has_cap(uint64_t cap)
{
    if (!s_queried)
    {
        /* Don't probe when the ESP32 HAL has not been initialised.  Probing
         * an uninitialised transport would time out and potentially cache a
         * fail-closed result that prevents legitimate capabilities later. */
        if (!m1_esp32_get_init_status())
            return false;
        m1_esp32_caps_init();
    }
    return (s_bitmap & cap) == cap;
}

const char *m1_esp32_caps_fw_name(void)
{
    if (!s_queried)
    {
        /* Return "offline" immediately — without probing or caching —
         * when the ESP32 HAL transport is not active.  This keeps the
         * RPC device-info response accurate for disconnected devices. */
        if (!m1_esp32_get_init_status())
            return "offline";
        m1_esp32_caps_init();
    }
    return s_fw_name[0] != '\0' ? s_fw_name : "Unknown";
}

bool m1_esp32_require_cap(uint64_t cap, const char *feature_name)
{
    char fw_line[22];  /* fits on 128px display with main-menu font */

    if (m1_esp32_has_cap(cap))
        return true;

    /* Draw the "not supported" screen and hold for 2 seconds so the user
     * can read it before the delegate pops the scene. */
    snprintf(fw_line, sizeof(fw_line), "%.21s", m1_esp32_caps_fw_name());

    u8g2_SetFont(&m1_u8g2, M1_DISP_MAIN_MENU_FONT_N);

    m1_u8g2_firstpage();
    do
    {
        /* Title */
        u8g2_DrawStr(&m1_u8g2, 0, 10, feature_name);
        u8g2_DrawHLine(&m1_u8g2, 0, 11, 128);

        /* Body */
        u8g2_DrawStr(&m1_u8g2, 0, 25, M1_ESP32_UNSUPPORTED_LINE_1);
        u8g2_DrawStr(&m1_u8g2, 0, 37, fw_line);
        u8g2_DrawStr(&m1_u8g2, 0, 52, M1_ESP32_UNSUPPORTED_LINE_2);
        u8g2_DrawStr(&m1_u8g2, 0, 62, M1_ESP32_UNSUPPORTED_LINE_3);
    }
    while (u8g2_NextPage(&m1_u8g2));

    HAL_Delay(2000);

    return false;
}

uint32_t m1_esp32_caps_bss_bytes(void)
{
    if (!s_queried && m1_esp32_get_init_status())
        m1_esp32_caps_init();
    return s_bss_bytes;
}

uint32_t m1_esp32_caps_free_heap(void)
{
    if (!s_queried && m1_esp32_get_init_status())
        m1_esp32_caps_init();
    return s_free_heap_bytes;
}

uint64_t m1_esp32_caps_get_bitmap(void)
{
    /* Return the cached bitmap without re-probing.  Callers that need the
     * bitmap for esp32_feature_map queries should ensure m1_esp32_caps_init()
     * has already run (e.g. via m1_esp32_ensure_init()). */
    return s_bitmap;
}
